adnat (backend)/app/controllers/organisations_controller.rb

SELECT "organisations".* FROM "organisations" WHERE "organisations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "organisations" SET "name" = ?, "hourly_rate" = ?, "updated_at" = ? WHERE "organisations"."id" = ?  [["name", "Wendy's"], ["hourly_rate", 10.0], ["updated_at", "2022-05-16 15:28:36.362796"], ["id", 1]]
---
    def update
        org = Organisation.find(params[:id])
        org.update!(org_params)

INSERT INTO "organisations" ("name", "hourly_rate", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "test"], ["hourly_rate", 3.0], ["created_at", "2022-05-16 19:10:04.408911"], ["updated_at", "2022-05-16 19:10:04.408911"]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "organisation_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["organisation_id", 9], ["updated_at", "2022-05-16 19:19:01.379581"], ["id", 1]]
---
    def create
        new_org = Organisation.create!(org_params)
        current_user = User.find(session[:user_id])
        current_user.update!(organisation_id: new_org.id)

SELECT "organisations".* FROM "organisations" WHERE "organisations"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users"."organisation_id" FROM "users"
DELETE FROM "organisations" WHERE "organisations"."id" = ?  [["id", 10]]
---
    def destroy
        ##.where
        old_org = Organisation.find(params[:id])
        if User.all.pluck(:organisation_id).include?(old_org.id)
            render json: "can't delete", status: :ok
        else
            old_org.destroy