adnat (backend)/app/controllers/users_controller.rb

    def create
        user = User.create!(user_params)
---
INSERT INTO "users" ("organisation_id", "name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["organisation_id", nil], ["name", "Adam"], ["email", "a@gmail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2022-05-15 17:55:59.744085"], ["updated_at", "2022-05-15 17:55:59.744085"]]

    def join
        user = User.find(params[:id])
        user.update!(org_id_param)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "organisation_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["organisation_id", 1], ["updated_at", "2022-05-16 16:39:54.512088"], ["id", 4]]

    def leave_org
        user = User.find(params[:id])
        user.update!(org_id_param)
        user.shifts.destroy_all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "organisation_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["organisation_id", nil], ["updated_at", "2022-05-17 14:28:09.718592"], ["id", 1]]
DELETE FROM "shifts" WHERE "shifts"."id" = ?  [["id", 3]]