adnat (backend)/app/serializers/user_serializer.rb

SELECT "organisations".* FROM "organisations" ORDER BY "organisations"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def orgs
    Organisation.all

SELECT "organisations".* FROM "organisations" WHERE "organisations"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT "shifts".* FROM "shifts" INNER JOIN "users" ON "shifts"."user_id" = "users"."id" WHERE "users"."organisation_id" = ?  [["organisation_id", 7]]
SELECT "users".* FROM "users" WHERE "users"."organisation_id" = ?  [["organisation_id", 13]]
---
  def all_shifts
    if current_user.organisation_id == nil
      puts "no shifts"
    else
      Organisation.find_by_id(current_user.organisation_id).users.map{|user| user.shifts}.flatten!